app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date desc
---
  def index

    cookies[:sort_column] = { value: sort_column, expires: 1.year.from_now }
    cookies[:sort_direction] = { value: sort_direction, expires: 1.year.from_now }

    @movies = Movie.order(sort_column + " " + sort_direction)

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "tes"], ["rating", "test"], ["description", "test"], ["release_date", nil], ["created_at", "2024-09-14 00:58:27.028178"], ["updated_at", "2024-09-14 00:58:27.028178"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 10]]
---
  def destroy
    @movie.destroy!